FLiNaK_Solidification/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 750;

boundaryField
{
    fixedWalls
    {
      type           zeroGradient;
    }

    bottom
    {
      type           fixedValue;
      value          uniform 550;
    }

    top
    {
        type           fixedValue;
        value          uniform 750;
    }

    frontAndBack
    {
        type           empty;
    }
}


// ************************************************************************* //
