FLiNaK_Solidification/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-3;

boundaryField
{
    bottom
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    top
    {
      type            epsilonWallFunction;
      value           $internalField;
      //  type            inletOutlet;
    //    inletValue      $internalField;
    //    value           $internalField;
    }

    fixedWalls
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
