FLiNaK_Solidification/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField       uniform 1e5;

boundaryField
{
    fixedWalls
    {
      type            fixedFluxPressure;
      value           uniform 1e5;
    }

    top
    {
      type            fixedFluxPressure;
      value           uniform 1e5;
    }

    bottom
    {
      type            fixedFluxPressure;
      value           uniform 1e5;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
